Autodesk.Revit.DB.DigitGroupingAmount
Since:
2014
The number of digits in each group when numbers are formatted with digit grouping.
Since:
2014

Autodesk.Revit.DB.DigitGroupingAmount.Three
Digits are in groups of three.

Autodesk.Revit.DB.DigitGroupingAmount.Two
Digits are in groups of two, with the exception of the first group to the left of the decimal symbol which contains three digits.